# . ./antidote.zsh
# fakedir=./tests/fakezdotdir
# ANTIDOTE_HOME=$fakedir/antidote_home
# antidote bundle <$fakedir/.zsh_plugins.txt >|$fakedir/.zsh_plugins_expected.zsh
# plugins
foo/bar
git@github.com:bar/baz.git  # trailing comments

# kind:clone
romkatv/zsh-defer kind:clone		# more trailing comments

# kind:zsh
foo/bar kind:zsh

# kind:fpath
foo/bar kind:fpath

# kind:path
foo/bar kind:path

# subpath plugins
ohmyzsh/ohmyzsh path:lib
ohmyzsh/ohmyzsh path:plugins/extract

# deferred
ohmyzsh/ohmyzsh path:plugins/magic-enter kind:defer

# theme
ohmyzsh/ohmyzsh path:custom/themes/pretty.zsh-theme
