# . ./antidote.zsh
# fakedir=./tests/zdotdir
# ANTIDOTE_HOME=$fakedir/antidote_home
# antidote bundle <$fakedir/.zsh_plugins.txt >|$fakedir/.zsh_plugins.zsh
# plugins
foo/bar
git@github.com:baz/qux.git  # trailing comments

# kind:clone
romkatv/zsh-defer kind:clone		# more trailing comments

# kind:zsh
foo/bar kind:zsh

# kind:fpath
foo/bar kind:fpath

# kind:path
foo/bar kind:path

# subpath plugins
ohmy/ohmy path:lib
ohmy/ohmy path:plugins/extract

# deferred
ohmy/ohmy path:plugins/magic-enter kind:defer

# theme
ohmy/ohmy path:custom/themes/pretty.zsh-theme
