# paths
#$ZDOTDIR/aliases.zsh
$ZSH_CUSTOM/plugins/myplugin

# plugins
zsh-users/zsh-history-substring-search
https://github.com/zsh-users/zsh-autosuggestions

# git@ repo URLs aren't good for CI... revisit
# git@github.com:zsh-users/zsh-completions.git

# kind:zsh
zsh-users/zsh-syntax-highlighting kind:zsh

# kind:clone
zsh-users/antigen kind:clone

# kind:fpath
sindresorhus/pure kind:fpath

# kind:path
romkatv/zsh-bench kind:path

# kind:autoload
mattmc3/zman path:functions kind:autoload

# fpath-rule
ohmyzsh/ohmyzsh path:plugins/gradle fpath-rule:prepend
ohmyzsh/ohmyzsh path:plugins/docker fpath-rule:append

# conditional
ohmyzsh/ohmyzsh path:plugins/macos conditional:is-macos

# branches
mattmc3/antidote branch:pz

# subpath plugins
ohmyzsh/ohmyzsh path:lib/clipboard.zsh
ohmyzsh/ohmyzsh path:plugins/extract
ohmyzsh/ohmyzsh path:plugins/magic-enter
ohmyzsh/ohmyzsh path:plugins/fancy-ctrl-z

# deferred
zdharma-continuum/fast-syntax-highlighting kind:defer

# theme
dracula/zsh

# non-conforming plugins
peterhurford/up.zsh
rummik/zsh-tailf
rupa/z
