# local plugins
~/foo/bar
$ZSH_CUSTOM path:plugins/myplugin

# repo plugins
foo/bar
git@github.com:foo/qux.git  # trailing comments

      # leading spaces don't matter
      foobar/barfoo annotation:a:b:c comment:"quz #fake comment"  #real comment

error/mcerror-face "def ghi" blah # xyz

# kind:clone
getantidote/zsh-defer kind:clone		# more trailing comments

# kind:zsh
foo/bar kind:zsh

# kind:zsh with quotes
foo/bar "kind:zsh"

# kind:zsh with single quotes
foo/bar kind:'zsh'

# kind:fpath
foo/bar kind:fpath

# kind:path
foo/bar kind:path

# subpath plugins
ohmy/ohmy path:lib
ohmy/ohmy path:plugins/extract

# deferred
ohmy/ohmy path:plugins/magic-enter kind:defer

# all-the-things
all/things path:plugins/things kind:defer branch:everything

# theme
ohmy/ohmy path:custom/themes/pretty.zsh-theme
